
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    //Контроль остатков
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходДенег.Контрагент КАК Контрагент,
		|	СУММА(РасходДенег.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Расходы
		|ИЗ
		|	Документ.РасходДенег КАК РасходДенег
		|ГДЕ
		|	РасходДенег.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходДенег.Контрагент
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Расходы.Контрагент КАК Контрагент,
		|	ВТ_Расходы.Сумма КАК Сумма,
		|	ВзаиморасчётыОстатки.Контрагент КАК Контрагент1,
		|	ЕСТЬNULL(ВзаиморасчётыОстатки.СуммаОстаток, 0) КАК ОстатокСредств
		|ИЗ
		|	ВТ_Расходы КАК ВТ_Расходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Взаиморасчёты.Остатки(
		|				&МоментВремени,
		|				Контрагент В
		|					(ВЫБРАТЬ
		|						ВТ_Расходы.Контрагент КАК Контрагент
		|					ИЗ
		|						ВТ_Расходы КАК ВТ_Расходы)) КАК ВзаиморасчётыОстатки
		|		ПО ВТ_Расходы.Контрагент = ВзаиморасчётыОстатки.Контрагент";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Сумма > ВыборкаДетальныеЗаписи.ОстатокСредств Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Для контрагента %1 не хватает %2 рублей",ВыборкаДетальныеЗаписи.Контрагент,(ВыборкаДетальныеЗаписи.Сумма - ВыборкаДетальныеЗаписи.ОстатокСредств));
			Сообщение.Сообщить();
		КонецЕсли;
		Если Отказ = Истина Тогда
			Продолжить;
		КонецЕсли;
		Движения.Взаиморасчёты.Записывать = Истина;
		Движение = Движения.Взаиморасчёты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	// регистр Взаиморасчёты Расход
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
