
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Попытка
		Движения.Взаиморасчёты.Записывать = Истина;
		Движение = Движения.Взаиморасчёты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Сумма = Сумма; 
	Исключение
		ЗаписьЖурналаРегистрации("ВнутреннийДокумент.РегистрПриходДенег",УровеньЖурналаРегистрации.Ошибка,
		Документы.ПриходДенег.Метаданные(),
		Документы.ПриходДенег);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить(Сообщение.Текст); 
	КонецПопытки;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
