Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = НазначениеПрефикса.УстановкаПрефикса(СкладОтправителя);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    // Контроль остатков по старой методике.
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Перемещения
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеТоваровТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Перемещения.Номенклатура КАК Номенклатура,
		|	ВТ_Перемещения.Количество КАК Количество,
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура1,
		|	ОстаткиТоваровОстатки.Склад КАК Склад,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ИЗ
		|	ВТ_Перемещения КАК ВТ_Перемещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ_Перемещения.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТ_Перемещения КАК ВТ_Перемещения)
		|					И Склад = &Склад) КАК ОстаткиТоваровОстатки
		|		ПО ВТ_Перемещения.Номенклатура = ОстаткиТоваровОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", СкладОтправителя);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Количество > ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Для перемещения товара %1 не хватает %2 штук",ВыборкаДетальныеЗаписи.Номенклатура,(ВыборкаДетальныеЗаписи.Количество - ВыборкаДетальныеЗаписи.КоличествоОстаток));
			Сообщение.Сообщить();
		КонецЕсли;
		Если Отказ = Истина Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			Движения.ОстаткиТоваров.Записывать = Истина;
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Склад = СкладОтправителя;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Исключение    
			ЗаписьЖурналаРегистрации("ВнутреннийДокумент.ОшибкаЗаписиВРегистрТоваровРасход",УровеньЖурналаРегистрации.Ошибка,
			ВыборкаДетальныеЗаписи.Документ.Метаданные(),
			ВыборкаДетальныеЗаписи.Документ); 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Сообщение.Сообщить(Сообщение.Текст);
		КонецПопытки;

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	// регистр ОстаткиТоваров Приход 
	Если Отказ = Ложь Тогда
		Попытка 
				Движения.ОстаткиТоваров.Записывать = Истина;
			Для Каждого ТекСтрокаТовары Из Товары Цикл
				Движение = Движения.ОстаткиТоваров.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
				Движение.Склад = СкладПолучения;
				Движение.Количество = ТекСтрокаТовары.Количество;
			КонецЦикла
		Исключение
			ЗаписьЖурналаРегистрации("ВнутреннийДокумент.ОшибкаЗаписиВРегистрОстаткиТоваровПриход",УровеньЖурналаРегистрации.Ошибка,
			Документы.ПеремещениеТоваров.Метаданные(),
			Документы.ПеремещениеТоваров);  
			
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Сообщение.Сообщить(Сообщение.Текст);
		КонецПопытки;
    КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Статус = Перечисления.СтатусДокумента.Новый;
КонецПроцедуры
