
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = НазначениеПрефикса.УстановкаПрефикса(Склад);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТоваров Приход
	Попытка
		Движения.ОстаткиТоваров.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаТовары.Количество;
		КонецЦикла;
	Исключение  
		 ЗаписьЖурналаРегистрации("ВнутреннийДокумент.ОшибкаЗписиВРегистрОстаткиТоваров",УровеньЖурналаРегистрации.Ошибка,
		 Документы.ПоступлениеТоваров.Метаданные(),
		 Документы.ПоступлениеТоваров);
		 
		 ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = ТекстОшибки;
		 Сообщение.Сообщить(); 
	КонецПопытки;

	// регистр ПоступлениеТоваров
	Попытка  
		Движения.ПоступлениеТоваров.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ПоступлениеТоваров.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.ТипНоменклатуры = ТекСтрокаТовары.ТипНоменклатуры;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.ТипОперации = Перечисления.ВидОперации.Поступление;
		КонецЦикла;
	Исключение 
		ЗаписьЖурналаРегистрации("ВнутреннийДокумент.ОшибкаЗаписиВРегистрПоступлениеТоваров",УровеньЖурналаРегистрации.Ошибка,
		Документы.ПоступлениеТоваров.Метаданные(),
		Документы.ПоступлениеТоваров);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить(Сообщение.Текст);
    КонецПопытки;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Статус = Перечисления.СтатусДокумента.Новый;
КонецПроцедуры
