
&НаКлиенте
Процедура Номенклатура(Команда)
	ПолучитьФорму("Справочник.Номенклатура.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Контрагент(Команда)
	ПолучитьФорму("Справочник.Контрагент.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Склады(Команда)
	ПолучитьФорму("Справочник.Склады.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеТоваров(Команда)
	ПолучитьФорму("Документ.ПоступлениеТоваров.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеТоваров(Команда)
	ПолучитьФорму("Документ.ПеремещениеТоваров.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура РеализацияТоваров(Команда)
	ПолучитьФорму("Документ.РеализацияТоваров.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура РасходДенег(Команда)
	ПолучитьФорму("Документ.РасходДенег.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриходДенег(Команда)
	ПолучитьФорму("Документ.ПриходДенег.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчётПоПродажеТоваров(Команда)
	ПолучитьФорму("Отчет.ОтчётПоПродажеТоваров.Форма").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеИОстаткиТоваров(Команда)
	ПолучитьФорму("Отчет.ДвижениеИОстаткиТоваров.Форма").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтчётПоВзаиморасчётам(Команда)
	ПолучитьФорму("Отчет.ОтчётПоВзаиморасчётам.Форма").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = Истина;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Ошибка! Нельзя закрыть рабочий стол";
	Сообщение.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТоваров(Команда)
	ПолучитьФорму("РегистрНакопления.ОстаткиТоваров.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Продажи(Команда)
	ПолучитьФорму("РегистрНакопления.Продажи.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура Взаиморасчёты(Команда)
	ПолучитьФорму("РегистрНакопления.Взаиморасчёты.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура РегистрПоступленияТоваров(Команда)
	ПолучитьФорму("РегистрСведений.ПоступлениеТоваров.ФормаСписка").Открыть();
КонецПроцедуры
